ArticunoFruna/SupaClock_IEE2463/sdkconfig.defaults
# ─────────────────────────────────────────────────────────────────────
# SupaClock — sdkconfig defaults para XIAO ESP32-S3 (8 MB Flash + 8 MB PSRAM)
# Carrier v1 con GPIO43/44 ocupados por botón / SPI_CS → consola por USB-JTAG.
# ─────────────────────────────────────────────────────────────────────

# Target chip
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash 8 MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (XIAO ESP32-S3 trae 8 MB octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Permite que malloc() vaya a PSRAM cuando el bloque es grande; SRAM queda
# libre para tareas críticas (CNN, SPI DMA, I2C ISR).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# CPU 240 MHz, dual-core
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# ── Consola USB-Serial-JTAG (libera GPIO43/44 para botón + SPI_CS) ──
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_NONE=n

# Brownout: ahora sí, el LDO del XIAO no se cae bajo carga moderada.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# Certificados embebidos: no
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# ── Bluetooth NimBLE 5.0 ──
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_STR_STORE=y
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=n
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=n
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_LOG_LEVEL=2

# Modem sleep BLE
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y

# ── Power management con light-sleep automático ──
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_PROFILING=y
CONFIG_PM_DFS_INIT_AUTO=y
# El min y max real se setean en runtime con esp_pm_configure().

# FreeRTOS introspección (idle hooks útiles para medir CPU del HAR)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# ── Optimizaciones tinyML / ESP-NN ──
# El SDK detecta la arquitectura (XTENSA S3) y usa kernels acelerados con
# instrucciones PIE de 128 bits. No hace falta flag explícito si tflite-micro
# se compila a través de esp-tflite-micro (managed component).
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# Heap tracing off en release; útil prender para perfilar memoria del CNN.
CONFIG_HEAP_TRACING_OFF=y

# LWIP / WiFi están off (no se usan); reduce footprint.
CONFIG_ESP_WIFI_ENABLED=n
